//操作符
//算术操作符  + - * / %
//移位操作符  >> <<
#include <stdio.h>
//int main()
//{
//	//int a = 9 / 2;    //运行整数除法，结果为4 商4余1，结果不会出现小数，所以结果为4而非4.5
//	//float a = 9 / 2;  //运行整数除法，结果为4.000000
//	//float a = 9 / 2.0;//除号两边有一个为小数就执行小数除法，故在浮点型内可使结果为4.500000
//	//int a = 9 % 2;//% - 取模（余），结果为1
//	//printf("%d\n", a);
//	int a = 2;
//	int b = a << 1;//左移操作符 - 移动的是二进制位比如 - 000010 - 000100 - 4
//	int c = a >> 1;//右移操作符 - 移动的是二进制位比如 - 000010 - 000001 - 1
//	printf("%d\n", b);
//	printf("%d\n", c);
//
//	
//	return 0;
//}

//位操作符 &按位与 |按位或 ^按位异或
//赋值操作符 = += -= *= /= &= ^= |= >>= <<=
//int main()
//{
//	int a = 2;
//	int b = 2;
//	//a = a + 5;
//	a += 5;
//	//b = b - 3;
//	b -= 3;
//	printf("%d\n", a);
//	printf("%d\n", b);
//	return 0;
//}

//单目操作符 - 只有一个操作数 - 即a+b，+能操作2个数，所以+是双目操作符
//！           逻辑反操作
//-            负值
//+            正值
//%            取地址
//sizeof       操作数的类型长度(以字节为单位)
//~            对一个数的二进制按位取反
//--           前置、后置--
//++           前置、后置++
//*            间接访问操作符(解引用操作符)
//(类型)       强制类型转换

//int main()
//{
//	//0表示假，那么非0就是真
//	int a = 10;
//	printf("%d\n", !a);
//	int b = 0;//真就是假，假就是真，结果为1
//	printf("%d\n", !b);
//
//	if (a)
//	{
//		//如果a为真，即
//	}
//	if (!a)
//	{
//		//如果a为假，即
//	}
//	a = -5;
//	a = -a;
//	a = +a;//a = a;
//
//	return 0;
//}

//int main()
//{
//	//sizeof是一个操作符
//	//sizeof后括号可以省略，说明sizeof不是函数，而是操作符
//	//计算类型或者变量的大小
//	int a = 10;
//	printf("%d\n", sizeof(int));
//	printf("%d\n", sizeof a);
//	return 0;
//}

int main()
{
	int arr[10] = { 0 };
	printf("%d\n", sizeof(arr));//计算的是数组的总大小，单位是字节
	printf("%d\n", sizeof(arr[0]));//4
	int sz = sizeof(arr) / sizeof(arr[0]);
	printf("%d\n", sz);
	return 0;
}

